#+TITLE: Literate Programming in Emacs
#+DATE: \today
#+AUTHOR: Sampath Singamsetty
#+STARTUP: latexpreview


# few macros
# ------------------------------------------
#+macro: emacs-version (eval emacs-version)
#+macro: org-version (eval org-version)
#+macro: today (eval (format-time-string "%m-%d-%Y"))
# ------------------------------------------


* Random code blocks

#+begin_src emacs-lisp :results pp
(message "org-version: %s" org-version)
#+end_src

#+RESULTS:
: "org-version: 9.6.15"

#+begin_src emacs-lisp :lexical no
(print emacs-version)
#+end_src

#+RESULTS:
: 29.3

#+NAME: two
#+BEGIN_SRC emacs-lisp
(+ 1 1)
#+END_SRC

#+NAME: three
#+BEGIN_SRC emacs-lisp :noweb yes
(+ <<two>> 1)
#+END_SRC

#+RESULTS: three
: 3

#+NAME: my-list
| A | 1 |
| B | 2 |
| C | 3 |
| D | 4 |
| E | 5 |

#+begin_src python :results output replace :session none :exports both :cache no :noweb no :var lst=my-list
print(lst)
#+end_src

#+RESULTS:
: [['A', 1], ['B', 2], ['C', 3], ['D', 4], ['E', 5]]
#+begin_src python :results value replace :session none :exports both :cache no :noweb no :var lst=my-list
return [[chr((ord(x) + 1)), y + 1] for x, y in lst]
#+end_src

#+RESULTS:
| B | 2 |
| C | 3 |
| D | 4 |
| E | 5 |
| F | 6 |

  src_emacs-lisp{emacs-version} {{{results(=27.1=)}}}
  src_emacs-lisp{org-version} {{{results(=9.4=)}}}

For ~Python~ code, if ~return~ is specified in the code then the code *flags* =:results value= should be specified

#+begin_src python :results value
def hello(str):
        return "Hello, " + str + "!"

return hello ("dude")
#+end_src

#+RESULTS:
: Hello, dude!

#+BEGIN_SRC python :results output
import random

random.seed(1)
print("Hello World! Here's a random number: %f" % random.random())
#+END_SRC

#+RESULTS:
: Hello World! Here's a random number: 0.134364


#+BEGIN_SRC ipython :results drawer :async t :session py2session
%matplotlib inline
import numpy as np
import matplotlib.pyplot as plt
#+END_SRC

#+RESULTS:
:results:
0 - ae471c1b-0d50-488a-a6e7-af92b8cfc32d
:end:

#+BEGIN_SRC ipython :results drawer :async t :session py2session
fig=plt.figure(facecolor='white')
plt.hist(np.random.randn(500000), bins=100);
#+END_SRC

#+RESULTS:
:results:
0 - e8fc3b58-ddcf-4795-88d0-a36ed940cf2d
:end:

# using return statement
# Entire source block will get indented and used as the body of main()
#+begin_src python :results value
def foo(x):
  if x>0:
    return x+1

  else:
    return x-1

return foo(5)
#+end_src

#+RESULTS:
: 6

** C and C++ code blocks
#+name: hello_c :exports both
#+begin_src C
#include <stdio.h>

int main(int argc, char *argv[])
{
  printf("Welcome to Literate Code\n");
  return 0;
}
#+end_src

#+RESULTS: hello_c :exports both
: Welcome to Literate Code

** Fetch remote data using restclient

#+NAME: restclient
#+begin_src restclient :exports code :results value :async t
POST http://httpbin.org/post
Content-Type: application/json

{
    "jql": "project = HSP",
    "startAt": 0,
    "maxResults": 15,
    "fields": [
        "summary",
        "status",
        "assignee"
    ]
}
#+end_src


#+begin_src sh :exports code :stdin restclient :wrap src json :async t
jq '.'
#+end_src


#+NAME: json-doc
#+begin_src sh :exports both :stdin restclient :wrap src json
jq -r .data
#+end_src

#+RESULTS: json-doc
#+begin_src json
{
    "jql": "project = HSP",
    "startAt": 0,
    "maxResults": 15,
    "fields": [
        "summary",
        "status",
        "assignee"
    ]
}
#+end_src

#+begin_src python :exports both :var jsondoc=json-doc :wrap src json
import json

data = json.loads(jsondoc)
print(json.dumps(data, indent=4))
#+end_src

#+RESULTS:
#+begin_src json
{
    "jql": "project = HSP",
    "startAt": 0,
    "maxResults": 15,
    "fields": [
        "summary",
        "status",
        "assignee"
    ]
}
#+end_src

#+name: wellknown-config
#+begin_src restclient :cache yes :exports code :results value :async t
GET https://api.dev.aws.united.com/oauth2/v1/.well-known/openid-configuration
#+end_src

#+NAME: openid-doc
#+begin_src sh :exports code :stdin wellknown-config :wrap src json
jq .
#+end_src


#+begin_src python :exports both :var jsondoc=openid-doc :wrap src example
import json

data = json.loads(jsondoc)
# print(json.dumps(data, indent=4))
print('Issuer Url: {}'.format(data['issuer']))
print('Token Url: {}'.format(data['token_endpoint']))
print('JWKS Url: {}'.format(data['jwks_uri']))
#+end_src

#+RESULTS:
#+begin_src example
Issuer Url: https://api.dev.aws.united.com
Token Url: https://api.dev.aws.united.com/oauth2/v1/token
JWKS Url: https://api.dev.aws.united.com/oauth2/v1/keys
#+end_src

Get pokemon information and cache it

#+NAME: pokemon-cached
#+begin_src restclient :exports code :results value drawer :cache yes :async t
GET https://pokeapi.co/api/v2/pokemon-species/25/
Accept: application/json
#+end_src

The drawer contains huge amount of data which we can check as below:

#+begin_src sh :exports both :stdin pokemon-cached :results output
wc
#+end_src

#+RESULTS:
:     1963    4772   62018

With large responses such as this one, it can be hard to get what the overall
structure is like, at a glance. Let’s use jq to create a few summaries of the
document.

#+begin_src sh :exports both :stdin pokemon-cached :wrap src json
jq 'keys'
#+end_src

#+RESULTS:
#+begin_src json
[
  "base_happiness",
  "capture_rate",
  "color",
  "egg_groups",
  "evolution_chain",
  "evolves_from_species",
  "flavor_text_entries",
  "form_descriptions",
  "forms_switchable",
  "gender_rate",
  "genera",
  "generation",
  "growth_rate",
  "habitat",
  "has_gender_differences",
  "hatch_counter",
  "id",
  "is_baby",
  "is_legendary",
  "is_mythical",
  "name",
  "names",
  "order",
  "pal_park_encounters",
  "pokedex_numbers",
  "shape",
  "varieties"
]
#+end_src

Now let’s look at the first item in the names array.

#+begin_src sh :exports both :stdin pokemon-cached :wrap src json :async t
jq '.names[0]'
#+end_src

#+RESULTS:
#+begin_src json
{
  "language": {
    "name": "ja-Hrkt",
    "url": "https://pokeapi.co/api/v2/language/1/"
  },
  "name": "ピカチュウ"
}
#+end_src

#+begin_src sh :exports both :stdin pokemon-cached :wrap src csv :async t
jq -r '.names[] | [.name, (.language | .name, .url)] | @csv'
#+end_src

#+RESULTS:
#+begin_src csv
"ピカチュウ","ja-Hrkt","https://pokeapi.co/api/v2/language/1/"
"Pikachu","roomaji","https://pokeapi.co/api/v2/language/2/"
"피카츄","ko","https://pokeapi.co/api/v2/language/3/"
"皮卡丘","zh-Hant","https://pokeapi.co/api/v2/language/4/"
"Pikachu","fr","https://pokeapi.co/api/v2/language/5/"
"Pikachu","de","https://pokeapi.co/api/v2/language/6/"
"Pikachu","es","https://pokeapi.co/api/v2/language/7/"
"Pikachu","it","https://pokeapi.co/api/v2/language/8/"
"Pikachu","en","https://pokeapi.co/api/v2/language/9/"
"ピカチュウ","ja","https://pokeapi.co/api/v2/language/11/"
"皮卡丘","zh-Hans","https://pokeapi.co/api/v2/language/12/"
#+end_src


#+name: opencv-libs
#+begin_src sh :exports both :results pp :wrap src shell :cache yes
pkg-config --cflags --libs opencv4
#+end_src

#+RESULTS[4d1e9b8fb43329867c94c152a95101ecd02f72b6]: opencv-libs
#+begin_src shell
-L/usr/local/lib -lopencv_gapi -lopencv_stitching -lopencv_alphamat -lopencv_aruco -lopencv_bgsegm -lopencv_bioinspired -lopencv_ccalib -lopencv_dnn_objdetect -lopencv_dnn_superres -lopencv_dpm -lopencv_face -lopencv_freetype -lopencv_fuzzy -lopencv_hfs -lopencv_img_hash -lopencv_intensity_transform -lopencv_line_descriptor -lopencv_mcc -lopencv_quality -lopencv_rapid -lopencv_reg -lopencv_rgbd -lopencv_saliency -lopencv_stereo -lopencv_structured_light -lopencv_phase_unwrapping -lopencv_superres -lopencv_optflow -lopencv_surface_matching -lopencv_tracking -lopencv_highgui -lopencv_datasets -lopencv_text -lopencv_plot -lopencv_videostab -lopencv_videoio -lopencv_wechat_qrcode -lopencv_xfeatures2d -lopencv_shape -lopencv_ml -lopencv_ximgproc -lopencv_video -lopencv_xobjdetect -lopencv_objdetect -lopencv_calib3d -lopencv_imgcodecs -lopencv_features2d -lopencv_dnn -lopencv_flann -lopencv_xphoto -lopencv_photo -lopencv_imgproc -lopencv_core
#+end_src


#+header: :flags -std=c++17 -rpath /usr/local/lib
#+header: :libs -lopencv_core -lopencv_highgui
#+BEGIN_SRC C++ :exports both :results output pp
#include "opencv2/core.hpp"
#include "opencv2/core/version.hpp"
#include <iostream>

using namespace std;
using namespace cv;

int main() {
    cout << "Testing OpenCV" << endl;
    cout << "OpenCV version: " << CV_VERSION << endl;
    cout << "Major version: " << CV_MAJOR_VERSION << endl;
    cout << "Minor version: " << CV_MINOR_VERSION << endl;
    cout << "Subminor version: " << CV_SUBMINOR_VERSION << endl;
}
#+END_SRC

#+RESULTS[7d1e5a2673c520d781dd8b447d8e602b16d2126e]:
: Testing OpenCV
: OpenCV version: 4.9.0
: Major version: 4
: Minor version: 9
: Subminor version: 0


#+BEGIN_EXPORT latex
Noweb style syntax: <<CODE-BLOCK-ID>>.

Where the CODE-BLOCK-ID refers to either the 'NAME' of a single source code
block, or a collection of one or more source code blocks sharing the same
'noweb-ref' header argument.
#+END_EXPORT

